quadPiston/case/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Injection
	injectionXMinus
    {
        type            zeroGradient;
    }
    injectionXPlus
    {
        type            zeroGradient;
    }
    injectionYMinus
    {
        type            zeroGradient;
    }
    injectionYPlus
    {
        type            zeroGradient;
    }
	
    // Inlet
	inletXMinus
    {
        type            zeroGradient;
    }
    inletXPlus
    {
        type            zeroGradient;
    }
    inletYMinus
    {
        type            zeroGradient;
    }
    inletYPlus
    {
        type            zeroGradient;
    }
	
	// Other
    outlet
    {
        type            fixedValue;
        value           uniform 0; 
    }
    valve
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
